{
  "version": "2.0.0",
  "project": {
    "name": "fspec",
    "vision": "Enable AI agents to build production-quality software through spec-driven development with ACDD workflow, eliminating babysitting and enforcing professional TDD discipline.",
    "projectType": "cli-tool"
  },
  "problemSpace": {
    "primaryProblem": {
      "title": "AI agents lack professional development infrastructure and quality examples",
      "description": "AI agents code without acceptance criteria enforcement, TDD guardrails, quality gates, or workflow management. Without quality examples, AI confabulates and hallucinates instead of asking clarifying questions, forcing developers to babysit instead of build.",
      "impact": "high"
    }
  },
  "solutionSpace": {
    "overview": "A complete spec-driven development system that provides AI agents with professional Gherkin scenarios, Example Mapping and Event Storming for discovery and quality examples, automated test generation from acceptance criteria, TDD enforcement with temporal ordering validation, interactive Kanban TUI with live updates, git-based checkpoint systems for safe experimentation, work unit-scoped virtual hooks for quality gates, reverse ACDD for legacy codebases, foundation-level domain architecture modeling, coverage tracking linking code to business rules, and attachment viewers for rich documentation.",
    "capabilities": [
      {
        "name": "Manage Work Units",
        "description": "Create, track, and move work through ACDD workflow states (backlog → specifying → testing → implementing → validating → done)"
      },
      {
        "name": "Conduct Discovery",
        "description": "Use Example Mapping and Event Storming to clarify requirements with quality examples before writing specifications"
      },
      {
        "name": "Write Specifications",
        "description": "Create Gherkin feature files with Given-When-Then scenarios that serve as living documentation and test foundations"
      },
      {
        "name": "Track Coverage",
        "description": "Link tests and implementation code to Gherkin scenarios for complete traceability from business rules to code"
      },
      {
        "name": "Create Checkpoints",
        "description": "Save and restore git-based snapshots of work for safe experimentation and rollback"
      },
      {
        "name": "Manage Quality Gates",
        "description": "Add work unit-scoped virtual hooks to enforce linting, testing, and validation at workflow transitions"
      },
      {
        "name": "Visualize Progress",
        "description": "View interactive Kanban TUI with live updates, work unit details, attachments, and checkpoint management"
      },
      {
        "name": "Reverse Engineer Codebases",
        "description": "Document existing codebases with feature files, test skeletons, and coverage mappings using reverse ACDD"
      }
    ]
  },
  "personas": [
    {
      "name": "AI Agent",
      "description": "AI coding assistant (Claude Code, Codex, etc.) that follows ACDD workflow to build features",
      "goals": [
        "Execute spec-driven development workflow with proper TDD discipline and quality gates"
      ]
    },
    {
      "name": "Developer/Product Owner",
      "description": "Human developer or product owner who guides AI agents through discovery and validates implementations",
      "goals": [
        "Guide AI agents to build production-quality software without constant babysitting"
      ]
    }
  ],
  "eventStorm": {
    "level": "big_picture",
    "items": [
      {
        "id": 1,
        "type": "bounded_context",
        "text": "Work Management",
        "color": null,
        "deleted": false,
        "createdAt": "2025-11-17T04:10:40.311Z"
      },
      {
        "id": 2,
        "type": "bounded_context",
        "text": "Specification",
        "color": null,
        "deleted": false,
        "createdAt": "2025-11-17T04:10:40.919Z"
      },
      {
        "id": 3,
        "type": "bounded_context",
        "text": "Testing & Validation",
        "color": null,
        "deleted": false,
        "createdAt": "2025-11-17T04:10:41.532Z"
      },
      {
        "id": 4,
        "type": "bounded_context",
        "text": "Quality Assurance",
        "color": null,
        "deleted": false,
        "createdAt": "2025-11-17T04:10:42.140Z"
      },
      {
        "id": 5,
        "type": "bounded_context",
        "text": "Version Control Integration",
        "color": null,
        "deleted": false,
        "createdAt": "2025-11-17T04:10:42.775Z"
      },
      {
        "id": 6,
        "type": "bounded_context",
        "text": "User Interface",
        "color": null,
        "deleted": false,
        "createdAt": "2025-11-17T04:10:43.382Z"
      },
      {
        "id": 7,
        "type": "bounded_context",
        "text": "Foundation Management",
        "color": null,
        "deleted": false,
        "createdAt": "2025-11-17T04:10:43.998Z"
      }
    ],
    "nextItemId": 8
  }
}